УправлениеВетеринарнойКлиникой/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Осмотр</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.АвансыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <attributes>
    <name>Осмотр</name>
    <type>
      <types>DocumentRef.Осмотр</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПозицииУслуг</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеВетеринарнойКлиникой/src/Enums/СтатусыОплаты/СтатусыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОплаты</name>
  <enumValues>
    <name>НеОплачено</name>
  </enumValues>
  <enumValues>
    <name>Оплачено</name>
  </enumValues>
</mdclass:Enum>

УправлениеВетеринарнойКлиникой/src/Documents/Чек/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьВсеПозицииПриОткрытии();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СтатусОплаты = Перечисления.СтатусыОплаты.НеОплачено;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.НеОплачено") 
	ИЛИ Объект.СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.ПустаяСсылка") Тогда
		Ответ = Ждать ВопросАсинх("Чек оплачен?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.Оплачено");;
			ПараметрыЗаписи = Новый Структура();
		    ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		    ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
		    Записать(ПараметрыЗаписи);		    
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти




#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииТоваров

&НаКлиенте
Процедура ПозицииТоваровТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПозицииТоваров.ТекущиеДанные;
	Если СтрокаТЧ.Товар <> Неопределено Тогда
		СтрокаТЧ.Цена = ПолучитьЦенуТовара(СтрокаТЧ.Товар);
		ПересчитатьПозицию(СтрокаТЧ);
		ПересчитатьОбщуюСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПозицииТоваров.ТекущиеДанные;
	ПересчитатьПозицию(СтрокаТЧ);
	ПересчитатьОбщуюСумму();
	СтрокаТЧ.Цена = ПолучитьЦенуТовара(СтрокаТЧ.Товар);
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПозицииТоваров.ТекущиеДанные;
	ПересчитатьПозицию(СтрокаТЧ);
	ПересчитатьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		ЗаполнитьИзКорзины(ВыбранноеЗначение);
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.ПозицииТоваров Цикл
        Если СтрокаТЧ.Товар <> Неопределено Тогда
            СтрокаТЧ.Цена = ПолучитьЦенуТовара(СтрокаТЧ.Товар);
        Иначе
            СтрокаТЧ.Цена = 0;
        КонецЕсли;
        ПересчитатьПозицию(СтрокаТЧ);
    КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПозицииТоваровТоварСоздание(Элемент, СтандартнаяОбработка)
	Для Каждого СтрокаТЧ Из Объект.ПозицииТоваров Цикл
        Если СтрокаТЧ.Товар <> Неопределено Тогда
            СтрокаТЧ.Цена = ПолучитьЦенуТовара(СтрокаТЧ.Товар);
        Иначе
            СтрокаТЧ.Цена = 0;
        КонецЕсли;
        ПересчитатьПозицию(СтрокаТЧ);
    КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииУслуг


&НаКлиенте
Процедура ПозицииУслугУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПозицииУслуг.ТекущиеДанные;
	Если СтрокаТЧ.Услуга <> Неопределено Тогда
		СтрокаТЧ.Цена = ПолучитьЦенуУслуги(СтрокаТЧ.Услуга);
		ПересчитатьПозицию(СтрокаТЧ);
		ПересчитатьОбщуюСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПозицииУслугКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПозицииУслуг.ТекущиеДанные;
	ПересчитатьПозицию(СтрокаТЧ);
	ПересчитатьОбщуюСумму();
	СтрокаТЧ.Цена = ПолучитьЦенуУслуги(СтрокаТЧ.Услуга);
КонецПроцедуры

&НаКлиенте
Процедура ПозицииУслугЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПозицииУслуг.ТекущиеДанные;
	ПересчитатьПозицию(СтрокаТЧ);
	ПересчитатьОбщуюСумму();
КонецПроцедуры
#КонецОбласти
&НаКлиенте
Асинх Процедура Подбор(Команда)
	
	Если ЗначениеЗаполнено(Объект.ПозицииТоваров) Тогда
		Ответ = Ждать ВопросАсинх(
			"После завершения подбора текущие данные таблицы будут заменены. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ОткрытьФорму("Справочник.Товары.Форма.ФормаПодбораСКорзиной", ,Элементы.ПозицииТоваров);
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьИзКорзины(Адрес)
	
	Корзина = ПолучитьИзВременногоХранилища(Адрес);
	Объект.ПозицииТоваров.Загрузить(Корзина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВсеПозицииПриОткрытии()
    // Обработка товаров
    Для Каждого СтрокаТЧ Из Объект.ПозицииТоваров Цикл
        Если СтрокаТЧ.Товар <> Неопределено Тогда
            СтрокаТЧ.Цена = ПолучитьЦенуТовара(СтрокаТЧ.Товар);
        Иначе
            СтрокаТЧ.Цена = 0;
        КонецЕсли;
        ПересчитатьПозицию(СтрокаТЧ);
    КонецЦикла;
    
    // Обработка услуг
    Для Каждого СтрокаТЧ Из Объект.ПозицииУслуг Цикл
        Если СтрокаТЧ.Услуга <> Неопределено Тогда
            СтрокаТЧ.Цена = ПолучитьЦенуУслуги(СтрокаТЧ.Услуга);
        Иначе
            СтрокаТЧ.Цена = 0;
        КонецЕсли;
        ПересчитатьПозицию(СтрокаТЧ);
    КонецЦикла;
    
    ПересчитатьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПозицию(СтрокаТЧ)
    // Устанавливаем количество по умолчанию
    Если СтрокаТЧ.Количество <= 0 Или СтрокаТЧ.Количество = Неопределено Тогда
        СтрокаТЧ.Количество = 1;
    КонецЕсли;
    
    // Считаем сумму позиции
    СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбщуюСумму()
	СуммаТоваров = 0;
	Для Каждого СтрокаТЧ ИЗ Объект.ПозицииТоваров Цикл
		СуммаТоваров = СуммаТоваров + СтрокаТЧ.Сумма;
	КонецЦикла;
	
	СуммаУслуг = 0;
	Для Каждого СтрокаТЧ ИЗ Объект.ПозицииУслуг Цикл
		СуммаУслуг = СуммаУслуг + СтрокаТЧ.Сумма;
	КонецЦикла;
	
	Объект.Сумма = СуммаТоваров + СуммаУслуг;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЦенуТовара(Товар)
    Возврат ПолучитьЦенуТовараНаСервере(Товар, Объект.Дата);
КонецФункции

&НаСервере
Функция ПолучитьЦенуТовараНаСервере(Товар, Дата)
    Возврат РаботаСЦенамиВызовСервера.ПолучитьЦенуТовара(Товар);
КонецФункции

&НаКлиенте
Функция ПолучитьЦенуУслуги(Услуга)
    Возврат ПолучитьЦенуУслугиНаСервере(Услуга, Объект.Дата);
КонецФункции

&НаСервере
Функция ПолучитьЦенуУслугиНаСервере(Услуга, Дата)
    Возврат РаботаСЦенамиВызовСервера.ПолучитьЦенуУслуги(Услуга);
КонецФункции

#КонецОбласти
